Documents/Приход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Приход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Наличие</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приход</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Приход/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьЦенуНоменклатурыПоставщика(Номенклатура)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныПоставщиков.Номенклатура КАК Номенклатура,
	               |	ЦеныПоставщиков.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныПоставщиков КАК ЦеныПоставщиков
	               |ГДЕ
	               |	ЦеныПоставщиков.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЦенаНоменклатуры = Результат.Получить(0).Цена; 
	
	Возврат ЦенаНоменклатуры 
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруПоставщика(Поставщик)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныПоставщиков.Поставщик КАК Поставщик,
	               |	ЦеныПоставщиков.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ЦеныПоставщиков КАК ЦеныПоставщиков
	               |ГДЕ
	               |	ЦеныПоставщиков.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	Результат = Запрос.Выполнить().Выгрузить();
	НоменклатураПоставщика = Результат.Получить(0).Номенклатура; 
	
	Возврат НоменклатураПоставщика
КонецФункции

&НаКлиенте
Процедура ПриходНоменклатураПриИзменении(Элемент)
	// Получение цены номенклатуры поставщика
	Стр = Элементы.Приход.ТекущиеДанные;
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.Номенклатура);
	Стр.Цена = ЦенаПоставщика;
	Стр.Сумма = Стр.Количество * Стр.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПриходПоставщикПриИзменении(Элемент)
	// Получение номенклатуры поставщика
	Стр = Элементы.Приход.ТекущиеДанные;
	НоменклатураПоставщика = ПолучитьНоменклатуруПоставщика(Стр.Поставщик);
	Стр.Номенклатура = НоменклатураПоставщика;
	
	// Получение цены номенклатуры поставщика, при изменении поставщика
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.Номенклатура);
	Стр.Цена = ЦенаПоставщика;
	Стр.Сумма = Стр.Количество * Стр.Цена;
КонецПроцедуры 

&НаКлиенте
Процедура ПриходКоличествоПриИзменении(Элемент)
	Стр = Элементы.Приход.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПриходЦенаЗаШтукуПриИзменении(Элемент)
	Стр = Элементы.Приход.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
КонецПроцедуры
